___

<a href='http://www.pieriandata.com'> <img src='../Pierian_Data_Logo.png' /></a>
___

# DataFrames

DataFrames are the workhorse of pandas and are directly inspired by the R programming language. We can think of a DataFrame as a bunch of Series objects put together to share the same index. Let's use pandas to explore this topic!

In [1]:
import pandas as pd
import numpy as np

In [2]:
from numpy.random import randn
np.random.seed(101)

In [3]:
# DataFrame(data(mxn), row_label(m), column_label(n))
# DataFrame(data) -> VALID, will simply make row and column labels as 0,1,2,3,...
# DataFrame(data,row_label) -> VALID, will simply make column labels as 0,1,2,3,...
# DataFrame(data,,column_label) -> INVALID
df = pd.DataFrame(randn(5,6),['A','B','C','D','E'],np.arange(1,7))

# IMPORTANT - The Columns and Rows in a DataFrame are Series.

In [4]:
df

          1         2         3         4         5         6
A  2.706850  0.628133  0.907969  0.503826  0.651118 -0.319318
B -0.848077  0.605965 -2.018168  0.740122  0.528813 -0.589001
C  0.188695 -0.758872 -0.933237  0.955057  0.190794  1.978757
D  2.605967  0.683509  0.302665  1.693723 -1.706086 -1.159119
E -0.134841  0.390528  0.166905  0.184502  0.807706  0.072960

In [5]:
type(df)

pandas.core.frame.DataFrame

In [6]:
type(df[2])

pandas.core.series.Series

## Selection and Indexing

Let's learn the various methods to grab data from a DataFrame

In [7]:
# Selecting 1 column, returns a Pandas Series.
df[3]

A    0.907969
B   -2.018168
C   -0.933237
D    0.302665
E    0.166905
Name: 3, dtype: float64

In [8]:
type(df[3])

pandas.core.series.Series

In [9]:
# Pass a list of column names to get multiple columns at once, returns a Pandas DataFrame.
df[[1,3,5]]

          1         3         5
A  2.706850  0.907969  0.651118
B -0.848077 -2.018168  0.528813
C  0.188695 -0.933237  0.190794
D  2.605967  0.302665 -1.706086
E -0.134841  0.166905  0.807706

In [10]:
type(df[[1,3,5]])

pandas.core.frame.DataFrame

In [11]:
# SQL Syntax (NOT RECOMMENDED!)
# df.W -> doesnt work if columns are numbers.

DataFrame Columns are just Series

In [12]:
type(df[1])

pandas.core.series.Series

**Creating a new column:**

In [13]:
# In a DataFrame we can create a new column using the following syntax -
# dataframe_name[column_name] = list, Numpy vector, of same size as the number of rows.
df["new1"] = df[1] + df[2]
df["new2"] = np.ones(5) * 5
df["new3"] = np.zeros(5)

In [14]:
df

,1,2,3,4,5,6,new1,new2,new3
A,2.706850,0.628133,0.907969,0.503826,0.651118,-0.319318,3.334983,5.0,0.0
B,-0.848077,0.605965,-2.018168,0.740122,0.528813,-0.589001,-0.242112,5.0,0.0
C,0.188695,-0.758872,-0.933237,0.955057,0.190794,1.978757,-0.570177,5.0,0.0
D,2.605967,0.683509,0.302665,1.693723,-1.706086,-1.159119,3.289476,5.0,0.0
E,-0.134841,0.390528,0.166905,0.184502,0.807706,0.072960,0.255687,5.0,0.0

**Removing Columns and Rows**

In [15]:
# To remove the rows we use drop(row_name,axis=0)
# To remove the columns we use drop(column_name,axis=1)
# HERE, axis=0 -> row (default)
# axis=1 -> column

df.drop(3,axis=1) # This deletion WON'T change "df" dataframe

          1         2         4         5         6      new1  new2  new3
A  2.706850  0.628133  0.503826  0.651118 -0.319318  3.334983   5.0   0.0
B -0.848077  0.605965  0.740122  0.528813 -0.589001 -0.242112   5.0   0.0
C  0.188695 -0.758872  0.955057  0.190794  1.978757 -0.570177   5.0   0.0
D  2.605967  0.683509  1.693723 -1.706086 -1.159119  3.289476   5.0   0.0
E -0.134841  0.390528  0.184502  0.807706  0.072960  0.255687   5.0   0.0

In [16]:
df.drop('C',axis=0) # This deletion WON'T change "df" dataframe

,1,2,3,4,5,6,new1,new2,new3
A,2.706850,0.628133,0.907969,0.503826,0.651118,-0.319318,3.334983,5.0,0.0
B,-0.848077,0.605965,-2.018168,0.740122,0.528813,-0.589001,-0.242112,5.0,0.0
D,2.605967,0.683509,0.302665,1.693723,-1.706086,-1.159119,3.289476,5.0,0.0
E,-0.134841,0.390528,0.166905,0.184502,0.807706,0.072960,0.255687,5.0,0.0

In [17]:
# Not inplace unless specified!
df

,1,2,3,4,5,6,new1,new2,new3
A,2.706850,0.628133,0.907969,0.503826,0.651118,-0.319318,3.334983,5.0,0.0
B,-0.848077,0.605965,-2.018168,0.740122,0.528813,-0.589001,-0.242112,5.0,0.0
C,0.188695,-0.758872,-0.933237,0.955057,0.190794,1.978757,-0.570177,5.0,0.0
D,2.605967,0.683509,0.302665,1.693723,-1.706086,-1.159119,3.289476,5.0,0.0
E,-0.134841,0.390528,0.166905,0.184502,0.807706,0.072960,0.255687,5.0,0.0

In [18]:
# To cause a change in original "df" dataframe, we have to give drop() an additional argument inPlace=True
# Default value of inplace is False, as we saw above.
df.drop("D",axis=0,inplace=True) # 'D' row deletion
df.drop(3,axis=1,inplace=True) # 3 column deletion

In [19]:
df

          1         2         4         5         6      new1  new2  new3
A  2.706850  0.628133  0.503826  0.651118 -0.319318  3.334983   5.0   0.0
B -0.848077  0.605965  0.740122  0.528813 -0.589001 -0.242112   5.0   0.0
C  0.188695 -0.758872  0.955057  0.190794  1.978757 -0.570177   5.0   0.0
E -0.134841  0.390528  0.184502  0.807706  0.072960  0.255687   5.0   0.0

In [20]:
df.shape # just like what we did for a numpy vector and matrix

(4, 8)

In [21]:
np.arange(1,7).shape

(6,)

In [22]:
np.arange(1,7).reshape(2,3).shape

(2, 3)

**Selecting Rows**

In [23]:
df

          1         2         4         5         6      new1  new2  new3
A  2.706850  0.628133  0.503826  0.651118 -0.319318  3.334983   5.0   0.0
B -0.848077  0.605965  0.740122  0.528813 -0.589001 -0.242112   5.0   0.0
C  0.188695 -0.758872  0.955057  0.190794  1.978757 -0.570177   5.0   0.0
E -0.134841  0.390528  0.184502  0.807706  0.072960  0.255687   5.0   0.0

In [24]:
df.loc['E'] # Selecting a row based on the row label.

1      -0.134841
2       0.390528
4       0.184502
5       0.807706
6       0.072960
new1    0.255687
new2    5.000000
new3    0.000000
Name: E, dtype: float64

In [25]:
df.iloc[3] # Selecting a row based on the index position.

1      -0.134841
2       0.390528
4       0.184502
5       0.807706
6       0.072960
new1    0.255687
new2    5.000000
new3    0.000000
Name: E, dtype: float64

**Selecting subset of rows and columns**

In [26]:
df.loc['C',5] # df.loc[rows, columns]

0.19079432237171562

In [27]:
df.loc[['E','A'],[5,2,'new1']]

          5         2      new1
E  0.807706  0.390528  0.255687
A  0.651118  0.628133  3.334983

### Conditional Selection

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [28]:
df

          1         2         4         5         6      new1  new2  new3
A  2.706850  0.628133  0.503826  0.651118 -0.319318  3.334983   5.0   0.0
B -0.848077  0.605965  0.740122  0.528813 -0.589001 -0.242112   5.0   0.0
C  0.188695 -0.758872  0.955057  0.190794  1.978757 -0.570177   5.0   0.0
E -0.134841  0.390528  0.184502  0.807706  0.072960  0.255687   5.0   0.0

In [29]:
# Jaise numpy vector/matrix mai conditional lagai thi to ek aisa vector / matrix mila jisme True / False filled hoga
# depending on the condition according to the elements, same to same pandas dataframes me hota he.
# Fir agr iss generated array ko agr dataframe me as index (inside square brakets) pass karde to jaha True he
# unke corresponding elements dikhte he aur False me NaN. 
bool_df = df > 0
bool_df

       1      2     4     5      6   new1  new2   new3
A   True   True  True  True  False   True  True  False
B  False   True  True  True  False  False  True  False
C   True  False  True  True   True  False  True  False
E  False   True  True  True   True   True  True  False

In [30]:
df[bool_df]

          1         2         4         5         6      new1  new2  new3
A  2.706850  0.628133  0.503826  0.651118       NaN  3.334983   5.0   NaN
B       NaN  0.605965  0.740122  0.528813       NaN       NaN   5.0   NaN
C  0.188695       NaN  0.955057  0.190794  1.978757       NaN   5.0   NaN
E       NaN  0.390528  0.184502  0.807706  0.072960  0.255687   5.0   NaN

In [31]:
df

          1         2         4         5         6      new1  new2  new3
A  2.706850  0.628133  0.503826  0.651118 -0.319318  3.334983   5.0   0.0
B -0.848077  0.605965  0.740122  0.528813 -0.589001 -0.242112   5.0   0.0
C  0.188695 -0.758872  0.955057  0.190794  1.978757 -0.570177   5.0   0.0
E -0.134841  0.390528  0.184502  0.807706  0.072960  0.255687   5.0   0.0

In [32]:
df[4] > 0.5 # Sare wo rows of column 4 jinme value > 0.5 -> true.

A     True
B     True
C     True
E    False
Name: 4, dtype: bool

In [33]:
df[df[4]>0.5] # Ye wo sari puri rows dedega jinme upar True aya tha.

          1         2         4         5         6      new1  new2  new3
A  2.706850  0.628133  0.503826  0.651118 -0.319318  3.334983   5.0   0.0
B -0.848077  0.605965  0.740122  0.528813 -0.589001 -0.242112   5.0   0.0
C  0.188695 -0.758872  0.955057  0.190794  1.978757 -0.570177   5.0   0.0

In [34]:
df[df[4]>0.5]['new1']

A    3.334983
B   -0.242112
C   -0.570177
Name: new1, dtype: float64

In [35]:
df[df[4]>0.5][[1,"new1",2]]
# OR
# df.loc[df[4]>0.5,[1,"new1",2]]

          1      new1         2
A  2.706850  3.334983  0.628133
B -0.848077 -0.242112  0.605965
C  0.188695 -0.570177 -0.758872

In [36]:
df

          1         2         4         5         6      new1  new2  new3
A  2.706850  0.628133  0.503826  0.651118 -0.319318  3.334983   5.0   0.0
B -0.848077  0.605965  0.740122  0.528813 -0.589001 -0.242112   5.0   0.0
C  0.188695 -0.758872  0.955057  0.190794  1.978757 -0.570177   5.0   0.0
E -0.134841  0.390528  0.184502  0.807706  0.072960  0.255687   5.0   0.0

For two conditions you can use  **OR | and AND & with parenthesis ()**:<br/>
"and" ya "or" of python can only work for single boolean values. For a Series of boolean values we use "&" and "|".

In [37]:
df[((df[6]>0) & (df[6]<1)) | ((df["new1"]>0) & (df["new1"]<3))]

          1         2         4         5        6      new1  new2  new3
E -0.134841  0.390528  0.184502  0.807706  0.07296  0.255687   5.0   0.0

In [38]:
df[(df[4]>0.5) & (df[4] < 0.9)][["new1","new2"]]

       new1  new2
A  3.334983   5.0
B -0.242112   5.0

## More Index Details

Let's discuss some more features of indexing, including resetting the index or setting it something else. We'll also talk about index hierarchy!

In [39]:
df

          1         2         4         5         6      new1  new2  new3
A  2.706850  0.628133  0.503826  0.651118 -0.319318  3.334983   5.0   0.0
B -0.848077  0.605965  0.740122  0.528813 -0.589001 -0.242112   5.0   0.0
C  0.188695 -0.758872  0.955057  0.190794  1.978757 -0.570177   5.0   0.0
E -0.134841  0.390528  0.184502  0.807706  0.072960  0.255687   5.0   0.0

In [40]:
# Reset to default 0,1...n index.
# Ye row wale labels ko ek new "index" column me daldega and row labels ko 0, 1, 2 ,3.... kar dega. This wont be inplace by
# default, agr inplace karna he to ek argument dedo inplace=True, reset_index() ko.
df.reset_index()

,index,1,2,4,5,6,new1,new2,new3
0,A,2.706850,0.628133,0.503826,0.651118,-0.319318,3.334983,5.0,0.0
1,B,-0.848077,0.605965,0.740122,0.528813,-0.589001,-0.242112,5.0,0.0
2,C,0.188695,-0.758872,0.955057,0.190794,1.978757,-0.570177,5.0,0.0
3,E,-0.134841,0.390528,0.184502,0.807706,0.072960,0.255687,5.0,0.0

In [41]:
newind = 'MP RJ DL MH'.split()

In [42]:
df['States'] = newind

In [43]:
df

,1,2,4,5,6,new1,new2,new3,States
A,2.706850,0.628133,0.503826,0.651118,-0.319318,3.334983,5.0,0.0,MP
B,-0.848077,0.605965,0.740122,0.528813,-0.589001,-0.242112,5.0,0.0,RJ
C,0.188695,-0.758872,0.955057,0.190794,1.978757,-0.570177,5.0,0.0,DL
E,-0.134841,0.390528,0.184502,0.807706,0.072960,0.255687,5.0,0.0,MH

In [44]:
# Now lets say that I want to set the "States" column as the row labels then I'll use the set_index() method - 
# Keep in mind doing this will overwrite the current row labels, ie the current row labels will be lost.
# set_index() ka bhi same he its not inplace by default, agr karna he to inplace=True karna hoga.
df.set_index('States')

               1         2         4         5         6      new1  new2  new3
States
MP      2.706850  0.628133  0.503826  0.651118 -0.319318  3.334983   5.0   0.0
RJ     -0.848077  0.605965  0.740122  0.528813 -0.589001 -0.242112   5.0   0.0
DL      0.188695 -0.758872  0.955057  0.190794  1.978757 -0.570177   5.0   0.0
MH     -0.134841  0.390528  0.184502  0.807706  0.072960  0.255687   5.0   0.0

In [45]:
df

,1,2,4,5,6,new1,new2,new3,States
A,2.706850,0.628133,0.503826,0.651118,-0.319318,3.334983,5.0,0.0,MP
B,-0.848077,0.605965,0.740122,0.528813,-0.589001,-0.242112,5.0,0.0,RJ
C,0.188695,-0.758872,0.955057,0.190794,1.978757,-0.570177,5.0,0.0,DL
E,-0.134841,0.390528,0.184502,0.807706,0.072960,0.255687,5.0,0.0,MH

In [46]:
df.set_index('States',inplace=True)

In [47]:
df

               1         2         4         5         6      new1  new2  new3
States
MP      2.706850  0.628133  0.503826  0.651118 -0.319318  3.334983   5.0   0.0
RJ     -0.848077  0.605965  0.740122  0.528813 -0.589001 -0.242112   5.0   0.0
DL      0.188695 -0.758872  0.955057  0.190794  1.978757 -0.570177   5.0   0.0
MH     -0.134841  0.390528  0.184502  0.807706  0.072960  0.255687   5.0   0.0

## Multi-Index and Index Hierarchy

Let us go over how to work with Multi-Index, first we'll create a quick example of what a Multi-Indexed DataFrame would look like:

In [51]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside)) # creating a list of tuples.
print(hier_index)

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [55]:
hier_index = pd.MultiIndex.from_tuples(hier_index) # Isse ek MultiIndex object create hoga
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [53]:
df = pd.DataFrame(randn(6,2),hier_index,["A","B"])
df
# Notice that the row labels have a hierarchy.
# G1, G2 then inside both of them there is 1, 2, 3

             A         B
G1 1  0.558769  1.024810
   2 -0.925874  1.862864
   3 -1.133817  0.610478
G2 1  0.386030  2.084019
   2 -0.376519  0.230336
   3  0.681209  1.035125

Now let's show how to index this! For index hierarchy we use df.loc[], if this was on the columns axis, you would just use normal bracket notation df[]. Calling one level of the index returns the sub-dataframe:

In [56]:
df.loc["G2"] # Sirf agr "G2" wale row level ko dekhe to wo bhi to khud ek dataframe he.

          A         B
1  0.386030  2.084019
2 -0.376519  0.230336
3  0.681209  1.035125

In [263]:
df.loc['G1'].loc[1]

A    0.153661
B    0.167638
Name: 1, dtype: float64

In [57]:
# Right now the row labels dont have names (labels wale columns me heading me kuch ni likha he)
df.index.names # Isse mai row labels ke names dekh paunga
# Will return a FrozenList object jiske andar list me names honge, which are None right now as we havent set them.

FrozenList([None, None])

In [60]:
df.index.names = ["Groups", "Nums"] # To set row label names

In [62]:
df

                    A         B
Groups Nums
G1     1     0.558769  1.024810
       2    -0.925874  1.862864
       3    -1.133817  0.610478
G2     1     0.386030  2.084019
       2    -0.376519  0.230336
       3     0.681209  1.035125

In [67]:
df.loc["G1"].loc[3,"A"]

-1.1338171615837889

In [74]:
# Ab manlo mujhe row label me inner wale 1 ke corresponding values chahiye -
# To ye G1 se bhi ayengi aur G2 se bhi.
# Doing something like this with loc() function is not recommended
# So for such cross selections we use the xs() method called the cross section method.

df.xs(1,level="Nums") # we have specied the row level here agr ni karte to by default outermost level aa jata.

               A         B
Groups
G1      0.558769  1.024810
G2      0.386030  2.084019

In [75]:
# Agr simply "G1" wale row level ka sara select karna he to -
df.xs("G1")

             A         B
Nums
1     0.558769  1.024810
2    -0.925874  1.862864
3    -1.133817  0.610478

In [91]:
df.xs(['G1',1]) # "G1" row level ke andar 1 wale row level se data lene ke liye. Remember these levels are passed in a list.

A    0.558769
B    1.024810
Name: (G1, 1), dtype: float64

In [ ]:
# PRACTICE

In [92]:
outside = ['G1','G2','G1','G2','G1','G2']
inside = [1,1,2,2,3,3]
col_index = list(zip(inside,outside))
col_index = pd.MultiIndex.from_tuples(col_index) # MultiIndex object banane ke liye.
multi_2 = pd.DataFrame(randn(6,6),hier_index,col_index)
multi_2

             1                   2                   3
            G1        G2        G1        G2        G1        G2
G1 1 -1.409126  0.870907  1.585812  0.929658 -0.550876  0.942045
   2 -0.975349 -1.054851  2.165421 -1.267240 -0.802843 -0.253479
   3  0.090699  1.321715  0.794129  1.359712  0.771970  0.294217
G2 1 -1.391519  0.147486 -0.729466 -0.720110 -0.285257  2.090539
   2  1.004056  1.031916 -1.081118 -0.000355 -0.219882  0.292795
   3  0.834355 -0.140432  0.119145  0.665715  0.407586  0.807843

In [96]:
multi_2.index.names=["Group","no."]
multi_2

                  1                   2                   3
                 G1        G2        G1        G2        G1        G2
Group no.
G1    1   -1.409126  0.870907  1.585812  0.929658 -0.550876  0.942045
      2   -0.975349 -1.054851  2.165421 -1.267240 -0.802843 -0.253479
      3    0.090699  1.321715  0.794129  1.359712  0.771970  0.294217
G2    1   -1.391519  0.147486 -0.729466 -0.720110 -0.285257  2.090539
      2    1.004056  1.031916 -1.081118 -0.000355 -0.219882  0.292795
      3    0.834355 -0.140432  0.119145  0.665715  0.407586  0.807843

In [99]:
# multi_2[1]["G2"].loc["G1"].loc[3]
# OR
# multi_2[1]["G2"].xs("G1").xs(3)
# OR
multi_2[1]["G2"].xs(["G1",3])

1.3217153465920728

# Great Job!